Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_tpu.c
/* lib/rx_hal/src/rx_tpu.c */

/**
 * @file rx_tpu.c
 * @brief TPU HAL Driver Implementation for Phase Counting Mode
 *
 * @details
 * Implementation of the TPU hardware abstraction layer for RX72N quadrature
 * encoder phase counting. This driver configures TPU channels 1, 2, 4, and 5
 * for hardware-based encoder position tracking with 4x resolution.
 *
 * ## Module Architecture
 *
 * The implementation is structured in three layers:
 * 1. **Constants & State**: Typed enums for all magic numbers, static tracking
 * 2. **Internal Helpers**: Channel validation, register access, bit mapping
 * 3. **Public API**: User-facing functions documented in rx_tpu.h
 *
 * ## Initialization Sequence
 *
 * @verbatim
 *   rx_tpu_init_phase_count(&config)
 *     |
 *     +-- 1. Validate config (NULL, channel, phase_mode)
 *     +-- 2. Check not already initialized
 *     +-- 3. Enable TPU module clock (MSTPCRA.MSTPA13 = 0)
 *     +-- 4. Stop channel counter (TSTR.CSTn = 0)
 *     +-- 5. Set phase counting mode (TMDR.MD = mode)
 *     +-- 6. Set TCR to free-running (CCLR = disabled)
 *     +-- 7. Clear TCNT to zero
 *     +-- 8. Disable interrupts (TIER = 0)
 *     +-- 9. Mark channel as initialized
 * @endverbatim
 *
 * ## Static Variables
 *
 * | Variable               | Type       | Purpose                              |
 * |------------------------|------------|--------------------------------------|
 * | s_tpu_initialized[]    | bool[4]    | Track which channels are initialized |
 * | s_tag                  | const char*| Log tag "TPU"                        |
 *
 * ## Channel-to-Index Mapping
 *
 * Phase counting channels (1, 2, 4, 5) are mapped to array indices 0-3:
 * | Channel | Index | Use in STAR         | Clock Pins      |
 * |---------|-------|---------------------|-----------------|
 * | TPU1    | 0     | Rear-left encoder   | TCLKA + TCLKB   |
 * | TPU2    | 1     | Rear-right encoder  | TCLKC + TCLKD   |
 * | TPU4    | 2     | Available           | TCLKC + TCLKD   |
 * | TPU5    | 3     | Available           | TCLKA + TCLKB   |
 *
 * @par Performance Characteristics
 * | Function                   | Time    | Stack | Notes                      |
 * |----------------------------|---------|-------|----------------------------|
 * | rx_tpu_init_phase_count()  | ~20 us  | 32 B  | One-time setup per channel |
 * | rx_tpu_start()             | ~0.5 us | 8 B   | Single register write      |
 * | rx_tpu_stop()              | ~0.5 us | 8 B   | Single register write      |
 * | rx_tpu_read_count()        | ~0.5 us | 8 B   | Single register read       |
 * | rx_tpu_read_direction()    | ~0.5 us | 8 B   | Single register read       |
 * | rx_tpu_reset_count()       | ~0.5 us | 8 B   | Single register write      |
 * | rx_tpu_deinit()            | ~1 us   | 16 B  | Stop + reset + cleanup     |
 *
 * @par Memory Usage
 * | Category         | Size       | Description                |
 * |------------------|------------|----------------------------|
 * | Code (.text)     | ~600 bytes | All functions              |
 * | Constants        | 4 bytes    | Tag string "TPU"           |
 * | Static data      | 4 bytes    | Initialized flags array    |
 * | Stack (max)      | 32 bytes   | Deepest call chain         |
 *
 * @par NASA Power of 10 Compliance
 * - Rule 1: No goto, setjmp, or recursion
 * - Rule 2: All loops bounded (no loops in this module)
 * - Rule 3: No dynamic memory allocation
 * - Rule 4: All functions < 60 lines
 * - Rule 5: Minimum 2 validation checks per function
 * - Rule 6: Variables at smallest scope
 * - Rule 7: All return values checked
 * - Rule 8: C23 typed enums for all constants
 * - Rule 9: Single-level pointers only
 * - Rule 10: Compiles with -Wall -Wextra -Werror
 *
 * @par SOLID Principles
 * - **S**: Only TPU hardware access (no encoder logic, no motor control)
 * - **O**: Extensible via rx_tpu_config_t without modifying existing code
 * - **L**: Consistent rx_err_t return semantics across all functions
 * - **I**: Focused API: init, start, stop, read, reset, deinit
 * - **D**: Depends on register abstractions (rx72n_tpu_regs.h), not raw addresses
 *
 * @see rx_tpu.h Public API documentation
 * @see rx72n_tpu_regs.h TPU register definitions
 * @see rx_mtu_encoder.h MTU encoder interface (front wheels)
 *
 * @author STAR Team
 * @date 2026-02-10
 * @copyright Copyright (c) 2026 STAR Project. MIT License.
 * @since Version 1.0.0
 */

#include "rx_tpu.h"

#include <stddef.h>

#include "rx72n_regs.h"
#include "rx_check.h"
#include "rx_log.h"
#include "rx_register_protection.h"

/* =============================================================================
 * Constants
 * =============================================================================
 */

/**
 * @var s_tag
 * @brief Logging tag for TPU module
 *
 * @details
 * Static constant string used as the tag parameter for all rx_log_*() calls
 * within this module.
 *
 * @par Value: "TPU"
 * @par Memory: 4 bytes in .rodata section
 *
 * @note Statically allocated, never modified
 * @since Version 1.0.0
 */
static const char* s_tag = "TPU";

/**
 * @enum tpu_phase_channel_count_t
 * @brief Number of phase-counting-capable TPU channels
 *
 * @details
 * TPU1, TPU2, TPU4, and TPU5 support phase counting mode.
 * TPU0 and TPU3 do NOT support phase counting.
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_tpu_phase_channel_count = 4, /**< Channels 1, 2, 4, 5 */
} tpu_phase_channel_count_t;

/**
 * @enum tpu_channel_index_t
 * @brief Array index mapping for phase-counting channels
 *
 * @details
 * Maps the non-contiguous channel numbers (1, 2, 4, 5) to contiguous
 * array indices (0-3) for the s_tpu_initialized[] tracking array.
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_tpu_idx_ch1 = 0, /**< TPU1 -> index 0 (rear-left encoder) */
  k_tpu_idx_ch2 = 1, /**< TPU2 -> index 1 (rear-right encoder) */
  k_tpu_idx_ch4 = 2, /**< TPU4 -> index 2 (available) */
  k_tpu_idx_ch5 = 3, /**< TPU5 -> index 3 (available) */
} tpu_channel_index_t;

/**
 * @enum tpu_tmdr_reset_t
 * @brief TMDR register reset value (normal mode)
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_tpu_tmdr_reset = 0x00, /**< Normal operation mode (reset default) */
} tpu_tmdr_reset_t;

/**
 * @enum tpu_tcr_phase_count_t
 * @brief TCR register value for phase counting mode
 *
 * @details
 * In phase counting mode, the TPSC and CKEG fields in TCR are ignored
 * because the external clock pins provide the counting signal. CCLR is
 * set to disabled (free-running counter).
 *
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_tpu_tcr_phase_count = 0x00, /**< Free-running: TPSC=0, CKEG=0, CCLR=0 */
} tpu_tcr_phase_count_t;

/**
 * @enum tpu_tier_disable_t
 * @brief TIER register value with all interrupts disabled
 * @since Version 1.0.0
 */
typedef enum : uint8_t {
  k_tpu_tier_all_disabled = 0x00, /**< All interrupt sources disabled */
} tpu_tier_disable_t;

/**
 * @enum tpu_tcnt_zero_t
 * @brief TCNT register zero value
 * @since Version 1.0.0
 */
typedef enum : uint16_t {
  k_tpu_tcnt_zero = 0x0000, /**< Counter cleared to zero */
} tpu_tcnt_zero_t;

