Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_tpu.c
/* =============================================================================
 * Static Variables
 * =============================================================================
 */

/**
 * @var s_tpu_initialized
 * @brief Track which phase-counting channels are initialized
 *
 * @details
 * Boolean array indexed by tpu_channel_index_t values (0-3).
 * Set to true by rx_tpu_init_phase_count(), false by rx_tpu_deinit().
 *
 * @warning Do not modify directly - use public API functions
 * @since Version 1.0.0
 */
static bool s_tpu_initialized[k_tpu_phase_channel_count] = {false, false, false, false};

/* =============================================================================
 * Internal Helper Functions
 * =============================================================================
 */

/**
 * @brief Map TPU channel number to array index
 *
 * @details
 * Converts the non-contiguous channel enumeration (1, 2, 4, 5) to a
 * contiguous array index (0-3) for use with s_tpu_initialized[].
 *
 * @param[in] channel TPU channel identifier
 * @param[out] index Pointer to store the array index
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Valid channel, index written
 * @retval k_rx_err_invalid_arg Channel is not 1, 2, 4, or 5
 *
 * @pre index must be non-NULL (caller responsibility)
 * @post *index contains valid array index on success
 *
 * @note Thread Safety: Safe - pure function with no shared state
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_channel_to_index(const rx_tpu_channel_t channel, uint8_t* index)
{
  switch (channel) {
    case k_tpu_channel_1:
      *index = k_tpu_idx_ch1;
      return k_rx_ok;
    case k_tpu_channel_2:
      *index = k_tpu_idx_ch2;
      return k_rx_ok;
    case k_tpu_channel_4:
      *index = k_tpu_idx_ch4;
      return k_rx_ok;
    case k_tpu_channel_5:
      *index = k_tpu_idx_ch5;
      return k_rx_ok;
    default:
      rx_log_error_val(s_tag, "Invalid TPU channel", (uint32_t)channel);
      return k_rx_err_invalid_arg;
  }
}

/**
 * @brief Get register pointer for a phase-counting TPU channel
 *
 * @details
 * Maps a TPU channel identifier to the corresponding hardware register
 * base address pointer. Only returns pointers for phase-counting-capable
 * channels (1, 2, 4, 5).
 *
 * @param[in] channel TPU channel identifier (1, 2, 4, or 5)
 *
 * @return Volatile pointer to TPU channel register structure
 * @retval Non-NULL Valid pointer for channels 1, 2, 4, 5
 * @retval NULL Invalid channel (not phase-counting capable)
 *
 * @pre TPU module enabled (MSTPCRA.MSTPA13 = 0)
 * @post No registers modified
 *
 * @note Thread Safety: Safe - returns constant hardware address
 *
 * @see tpu1(), tpu2(), tpu4(), tpu5() Underlying accessor functions
 * @since Version 1.0.0
 */
static volatile rx_tpu_regs_t* internal_get_regs(const rx_tpu_channel_t channel)
{
  switch (channel) {
    case k_tpu_channel_1:
      return tpu1();
    case k_tpu_channel_2:
      return tpu2();
    case k_tpu_channel_4:
      return tpu4();
    case k_tpu_channel_5:
      return tpu5();
    default:
      return nullptr;
  }
}

/**
 * @brief Get TSTR CST bit mask for a TPU channel
 *
 * @details
 * Returns the counter start bit mask in TSTR for the specified channel.
 * This bit is set to start counting and cleared to stop counting.
 *
 * @param[in] channel TPU channel identifier (1, 2, 4, or 5)
 *
 * @return TSTR bit mask for the channel
 * @retval Non-zero Valid CST bit mask
 * @retval 0 Invalid channel
 *
 * @note Thread Safety: Safe - pure function
 *
 * @since Version 1.0.0
 */
static uint8_t internal_get_cst_bit(const rx_tpu_channel_t channel)
{
  switch (channel) {
    case k_tpu_channel_1:
      return k_tpu_tstr_cst1;
    case k_tpu_channel_2:
      return k_tpu_tstr_cst2;
    case k_tpu_channel_4:
      return k_tpu_tstr_cst4;
    case k_tpu_channel_5:
      return k_tpu_tstr_cst5;
    default:
      return 0;
  }
}

/**
 * @brief Map rx_tpu_phase_mode_t to TMDR.MD register value
 *
 * @details
 * Converts the phase mode enumeration (1-4) to the corresponding TMDR
 * register value for phase counting mode selection.
 *
 * @param[in] mode Phase counting mode (1-4)
 *
 * @return TMDR.MD register value
 * @retval 0x04-0x07 Valid phase counting mode values
 * @retval 0x00 Invalid mode (normal operation fallback)
 *
 * @note Thread Safety: Safe - pure function
 *
 * @see rx_tpu_tmdr_md_t TMDR mode register values
 * @since Version 1.0.0
 */
static uint8_t internal_get_tmdr_mode(const rx_tpu_phase_mode_t mode)
{
  switch (mode) {
    case k_tpu_phase_mode_1:
      return k_tpu_tmdr_md_phase_count_1;
    case k_tpu_phase_mode_2:
      return k_tpu_tmdr_md_phase_count_2;
    case k_tpu_phase_mode_3:
      return k_tpu_tmdr_md_phase_count_3;
    case k_tpu_phase_mode_4:
      return k_tpu_tmdr_md_phase_count_4;
    default:
      return k_tpu_tmdr_md_normal;
  }
}

/**
 * @brief Enable TPU module clock by clearing MSTPCRA.MSTPA13
 *
 * @details
 * Enables the TPU peripheral by clearing its module stop bit in MSTPCRA.
 * Uses the PRCR register protection unlock/lock sequence. Idempotent -
 * safe to call multiple times.
 *
 * @pre System clock configured
 * @post TPU module clock enabled (MSTPCRA.MSTPA13 = 0)
 * @post PRCR protection re-enabled
 *
 * @note Thread Safety: Not thread-safe (modifies system-wide registers)
 *
 * @since Version 1.0.0
 */
static void internal_enable_tpu_module_clock(void)
{
  *prcr_reg() = k_rx_prcr_unlock_prc1;
  system_regs()->mstpcra &= ~(uint32_t)k_tpu_mstpcra_mstpa13;
  *prcr_reg() = k_rx_prcr_lock;
}

/* =============================================================================
 * Public API Implementation
 * =============================================================================
 */

/**
 * @brief Initialize TPU channel for phase counting mode
 *
 * @details
 * Implementation of rx_tpu_init_phase_count() - see rx_tpu.h for complete
 * API documentation.
 *
 * @par Register Configuration Sequence
 * 1. Unlock PRCR, clear MSTPCRA.MSTPA13, lock PRCR
 * 2. Clear CSTn in TSTR (stop counter)
 * 3. Write phase counting mode to TMDR.MD
 * 4. Write 0x00 to TCR (free-running, external clock)
 * 5. Write 0x00 to TIER (no interrupts)
 * 6. Write 0x0000 to TCNT (clear counter)
 *
 * @see rx_tpu.h Full API documentation
 * @since Version 1.0.0
 */
rx_err_t rx_tpu_init_phase_count(const rx_tpu_config_t* config)
{
  /* Pre-condition 1: validate config pointer (NASA Rule 5) */
  RX_CHECK_NULL_PTR(config, s_tag, "Config pointer is nullptr");

  /* Pre-condition 2: validate channel is phase-counting capable */
  uint8_t        idx = 0U;
  const rx_err_t err = internal_channel_to_index(config->channel, &idx);
  if (err != k_rx_ok) {
    return err;
  }

  /* Pre-condition 3: validate phase mode range */
  const uint8_t tmdr_mode = internal_get_tmdr_mode(config->phase_mode);
  if (tmdr_mode == k_tpu_tmdr_md_normal) {
    rx_log_error_val(s_tag, "Invalid phase mode", (uint32_t)config->phase_mode);
    return k_rx_err_invalid_arg;
  }

  /* Pre-condition 4: check not already initialized */
  if (s_tpu_initialized[idx]) {
    rx_log_error(s_tag, "Channel already initialized");
    return k_rx_err_invalid_state;
  }

  /* 1. Enable TPU module clock */
  internal_enable_tpu_module_clock();

  /* 2. Get register pointer */
  volatile rx_tpu_regs_t* regs = internal_get_regs(config->channel);
  if (regs == nullptr) {
    return k_rx_err_invalid_arg;
  }

