Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_tpu.c
  /* 3. Stop counter */
  const uint8_t cst_bit = internal_get_cst_bit(config->channel);
  tpu_control()->tstr &= (uint8_t)~cst_bit;

  /* 4. Configure TCR - free-running (TPSC/CKEG ignored in phase count mode) */
  regs->tcr = k_tpu_tcr_phase_count;

  /* 5. Set phase counting mode in TMDR */
  regs->tmdr = tmdr_mode;

  /* 6. Disable all interrupts */
  regs->tier = k_tpu_tier_all_disabled;

  /* 7. Clear counter */
  regs->tcnt = k_tpu_tcnt_zero;

  /* 8. Mark channel as initialized */
  s_tpu_initialized[idx] = true;

  rx_log_info(s_tag, "TPU phase count initialized");
  rx_log_info_val(s_tag, "  channel", (uint32_t)config->channel);
  rx_log_info_val(s_tag, "  mode", (uint32_t)config->phase_mode);

  return k_rx_ok;
}

/**
 * @brief Start the TPU channel counter (begin phase counting)
 *
 * @details
 * Sets the Count Start (CSTn) bit in the TSTR register to begin counter
 * operation. Once started, the TCNT register increments or decrements on
 * each external encoder clock edge according to the configured phase mode.
 *
 * @param[in] channel TPU channel to start (1, 2, 4, or 5)
 *   - Must have been previously initialized via rx_tpu_init_phase_count()
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Counter started successfully
 * @retval k_rx_err_invalid_arg Channel is not 1, 2, 4, or 5
 * @retval k_rx_err_not_initialized Channel not yet initialized
 *
 * @pre Channel must be initialized via rx_tpu_init_phase_count()
 * @pre External encoder clock pins must be connected and valid
 *
 * @post TSTR.CSTn bit set, counter begins counting encoder pulses
 * @post TCNT updates in real time from encoder edges
 *
 * @note Not thread-safe: modifies shared TSTR register
 * @note Idempotent: safe to call when already running
 *
 * @code{.c}
 * rx_err_t err = rx_tpu_start(k_tpu_channel_1);
 * @endcode
 *
 * @see rx_tpu_stop() Stop the counter
 * @see rx_tpu_read_count() Read current counter value
 *
 * @since Version 1.0.0
 */
rx_err_t rx_tpu_start(const rx_tpu_channel_t channel)
{
  /* Pre-condition 1: validate channel */
  uint8_t idx = 0U;
  rx_err_t const err = internal_channel_to_index(channel, &idx);
  if (err != k_rx_ok) {
    return err;
  }

  /* Pre-condition 2: check initialized */
  RX_VALIDATE_INIT(s_tpu_initialized[idx], s_tag, "Channel not initialized");

  /* Set CSTn bit in TSTR to start counter */
  const uint8_t cst_bit = internal_get_cst_bit(channel);
  tpu_control()->tstr |= cst_bit;

  return k_rx_ok;
}

/**
 * @brief Stop the TPU channel counter (halt phase counting)
 *
 * @details
 * Clears the Count Start (CSTn) bit in the TSTR register to halt counter
 * operation. The TCNT value is preserved and encoder edges no longer update
 * it. The channel remains initialized and can be restarted with rx_tpu_start().
 *
 * @param[in] channel TPU channel to stop (1, 2, 4, or 5)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Counter stopped successfully
 * @retval k_rx_err_invalid_arg Channel is not 1, 2, 4, or 5
 * @retval k_rx_err_not_initialized Channel not yet initialized
 *
 * @pre Channel must be initialized via rx_tpu_init_phase_count()
 * @pre TSTR register must be accessible (module clock enabled)
 *
 * @post TSTR.CSTn bit cleared, counter halted
 * @post TCNT value preserved at last count
 *
 * @note Not thread-safe: modifies shared TSTR register
 * @note Idempotent: safe to call when already stopped
 *
 * @code{.c}
 * rx_err_t err = rx_tpu_stop(k_tpu_channel_1);
 * @endcode
 *
 * @see rx_tpu_start() Resume counter operation
 * @see rx_tpu_reset_count() Clear counter to zero
 *
 * @since Version 1.0.0
 */
rx_err_t rx_tpu_stop(const rx_tpu_channel_t channel)
{
  /* Pre-condition 1: validate channel */
  uint8_t idx = 0U;
  rx_err_t const err = internal_channel_to_index(channel, &idx);
  if (err != k_rx_ok) {
    return err;
  }

  /* Pre-condition 2: check initialized */
  RX_VALIDATE_INIT(s_tpu_initialized[idx], s_tag, "Channel not initialized");

  /* Clear CSTn bit in TSTR to stop counter */
  const uint8_t cst_bit = internal_get_cst_bit(channel);
  tpu_control()->tstr &= (uint8_t)~cst_bit;

  return k_rx_ok;
}

/**
 * @brief Read the current 16-bit encoder counter value
 *
 * @details
 * Performs a single volatile read of the TCNT register for the specified
 * channel. In 4x phase counting mode, the counter increments or decrements
 * on every edge of both A and B encoder channels.
 *
 * @param[in]  channel TPU channel to read (1, 2, 4, or 5)
 * @param[out] count   Pointer to store the 16-bit counter value [0, 65535]
 *   - Must be non-NULL
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Counter value read into *count
 * @retval k_rx_err_null_ptr count pointer is nullptr
 * @retval k_rx_err_invalid_arg Channel is not 1, 2, 4, or 5
 * @retval k_rx_err_not_initialized Channel not yet initialized
 *
 * @pre Channel must be initialized via rx_tpu_init_phase_count()
 * @pre count must point to valid uint16_t storage
 *
 * @post *count contains the TCNT register value at the time of the read
 * @post Hardware registers unchanged
 *
 * @note Not thread-safe: counter may wrap between multiple reads
 * @note Wraps naturally at 0 and 65535 (16-bit overflow)
 *
 * @code{.c}
 * uint16_t count;
 * rx_err_t err = rx_tpu_read_count(k_tpu_channel_1, &count);
 * @endcode
 *
 * @see rx_tpu_reset_count() Clear counter to zero
 * @see rx_tpu_read_direction() Read counting direction
 *
 * @since Version 1.0.0
 */
rx_err_t rx_tpu_read_count(const rx_tpu_channel_t channel, uint16_t* count)
{
  /* Pre-condition 1: validate output pointer */
  RX_CHECK_NULL_PTR(count, s_tag, "Count pointer is nullptr");

  /* Pre-condition 2: validate channel */
  uint8_t        idx = 0U;
  const rx_err_t err = internal_channel_to_index(channel, &idx);
  if (err != k_rx_ok) {
    return err;
  }

  /* Pre-condition 3: check initialized */
  RX_VALIDATE_INIT(s_tpu_initialized[idx], s_tag, "Channel not initialized");

  /* Read TCNT register */
  const volatile rx_tpu_regs_t* regs = internal_get_regs(channel);
  if (regs == nullptr) {
    return k_rx_err_invalid_arg;
  }

  *count = regs->tcnt;

