Locked-Inc/STAR/e2-studio-star-rx72n-firmware/libs/rx_hal/src/rx_tpu.c
  return k_rx_ok;
}

/**
 * @brief Read the current encoder counting direction
 *
 * @details
 * Reads the Timer Counter Flag Direction (TCFD) bit in the TSR register.
 * TCFD reflects the last count event direction:
 * - TCFD = 1: Counter incremented on the last edge (counting up / forward)
 * - TCFD = 0: Counter decremented on the last edge (counting down / reverse)
 *
 * @param[in]  channel     TPU channel to query (1, 2, 4, or 5)
 * @param[out] counting_up Pointer to store direction result
 *   - true  = last count was an increment (encoder moving forward)
 *   - false = last count was a decrement (encoder moving in reverse)
 *   - Must be non-NULL
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Direction read into *counting_up
 * @retval k_rx_err_null_ptr counting_up pointer is nullptr
 * @retval k_rx_err_invalid_arg Channel is not 1, 2, 4, or 5
 * @retval k_rx_err_not_initialized Channel not yet initialized
 *
 * @pre Channel must be initialized via rx_tpu_init_phase_count()
 * @pre counting_up must point to valid bool storage
 *
 * @post *counting_up reflects TSR.TCFD at the time of the read
 * @post Hardware registers unchanged
 *
 * @note Not thread-safe: value may change between reads if encoder is moving
 * @note Direction is unreliable if counter is stationary (no recent edge)
 *
 * @code{.c}
 * bool forward;
 * rx_err_t err = rx_tpu_read_direction(k_tpu_channel_1, &forward);
 * @endcode
 *
 * @see rx_tpu_read_count() Read counter position
 * @see k_tpu_tsr_tcfd TSR direction bit mask
 *
 * @since Version 1.0.0
 */
rx_err_t rx_tpu_read_direction(const rx_tpu_channel_t channel, bool* counting_up)
{
  /* Pre-condition 1: validate output pointer */
  RX_CHECK_NULL_PTR(counting_up, s_tag, "Direction pointer is nullptr");

  /* Pre-condition 2: validate channel */
  uint8_t idx = 0U;
  const rx_err_t err = internal_channel_to_index(channel, &idx);
  if (err != k_rx_ok) {
    return err;
  }

  /* Pre-condition 3: check initialized */
  RX_VALIDATE_INIT(s_tpu_initialized[idx], s_tag, "Channel not initialized");

  /* Read TSR.TCFD bit */
  const volatile rx_tpu_regs_t* regs = internal_get_regs(channel);
  if (regs == nullptr) {
    return k_rx_err_invalid_arg;
  }

  *counting_up = (regs->tsr & k_tpu_tsr_tcfd) != 0;

  return k_rx_ok;
}

/**
 * @brief Reset the TPU channel encoder counter to zero
 *
 * @details
 * Writes k_tpu_tcnt_zero (0x0000) to the TCNT register, resetting the
 * encoder position counter. The counter continues running from the new
 * zero baseline.
 *
 * Typical use: zero encoder position at a known reference point (home).
 *
 * @param[in] channel TPU channel to reset (1, 2, 4, or 5)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Counter reset to zero successfully
 * @retval k_rx_err_invalid_arg Channel is not 1, 2, 4, or 5
 * @retval k_rx_err_not_initialized Channel not yet initialized
 *
 * @pre Channel must be initialized via rx_tpu_init_phase_count()
 * @pre Channel should be stopped (rx_tpu_stop()) before resetting for atomic 0
 *
 * @post TCNT register written to 0x0000
 * @post Counter resumes from zero if running
 *
 * @note Not thread-safe: write races with live counter updates from encoder
 * @note May cause a single spurious velocity estimate if called while running
 *
 * @code{.c}
 * rx_tpu_stop(k_tpu_channel_1);
 * rx_tpu_reset_count(k_tpu_channel_1);
 * rx_tpu_start(k_tpu_channel_1);
 * @endcode
 *
 * @see rx_tpu_stop() Stop counter before resetting for deterministic result
 * @see rx_tpu_read_count() Verify counter after reset
 *
 * @since Version 1.0.0
 */
rx_err_t rx_tpu_reset_count(const rx_tpu_channel_t channel)
{
  /* Pre-condition 1: validate channel */
  uint8_t idx = 0U;
  const rx_err_t err = internal_channel_to_index(channel, &idx);
  if (err != k_rx_ok) {
    return err;
  }

  /* Pre-condition 2: check initialized */
  RX_VALIDATE_INIT(s_tpu_initialized[idx], s_tag, "Channel not initialized");

  /* Write 0 to TCNT */
  volatile rx_tpu_regs_t* const regs = internal_get_regs(channel);
  if (regs == nullptr) {
    return k_rx_err_invalid_arg;
  }

  regs->tcnt = k_tpu_tcnt_zero;

  return k_rx_ok;
}

/**
 * @brief Deinitialize a TPU phase-counting channel
 *
 * @details
 * Performs an orderly shutdown of the specified TPU channel:
 * 1. Validate channel and get array index
 * 2. Stop counter (clear CSTn in TSTR)
 * 3. Reset TMDR to normal operation mode (0x00)
 * 4. Disable all interrupts (TIER = 0)
 * 5. Clear counter (TCNT = 0)
 * 6. Mark channel as uninitialized in s_tpu_initialized[]
 *
 * This function does NOT disable the TPU module clock (MSTPCRA.MSTPA13),
 * as other channels may still be in use.
 *
 * @param[in] channel TPU channel to deinitialize (1, 2, 4, or 5)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Channel deinitialized successfully
 * @retval k_rx_err_invalid_arg Channel is not 1, 2, 4, or 5
 * @retval k_rx_err_invalid_arg Register pointer could not be resolved
 *
 * @pre channel must be a valid phase-counting TPU channel (1, 2, 4, or 5)
 * @pre Motor driven by this encoder must be stopped before calling
 *
 * @post Counter stopped and zeroed
 * @post TMDR reset to normal mode
 * @post s_tpu_initialized[idx] == false
 *
 * @note Not thread-safe: do not access channel concurrently during deinit
 * @note Channel may be partially initialized; deinit succeeds regardless
 *
 * @code{.c}
 * rx_err_t err = rx_tpu_deinit(k_tpu_channel_1);
 * @endcode
 *
 * @see rx_tpu_init_phase_count() Re-initialize after deinit
 * @see rx_tpu_stop() Stop counter without full teardown
 *
 * @since Version 1.0.0
 */
rx_err_t rx_tpu_deinit(const rx_tpu_channel_t channel)
{
  /* Pre-condition 1: validate channel */
  uint8_t idx = 0U;
  const rx_err_t err = internal_channel_to_index(channel, &idx);
  if (err != k_rx_ok) {
    return err;
  }

  /* Get register pointer (no init check - allow deinit of partially init'd channel) */
  volatile rx_tpu_regs_t* const regs = internal_get_regs(channel);
  if (regs == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* 1. Stop counter */
  const uint8_t cst_bit = internal_get_cst_bit(channel);
  tpu_control()->tstr &= (uint8_t)~cst_bit;

  /* 2. Reset mode to normal operation */
  regs->tmdr = k_tpu_tmdr_reset;

  /* 3. Disable all interrupts */
  regs->tier = k_tpu_tier_all_disabled;

  /* 4. Clear counter */
  regs->tcnt = k_tpu_tcnt_zero;

  /* 5. Mark channel as uninitialized */
  s_tpu_initialized[idx] = false;

  rx_log_info_val(s_tag, "TPU channel deinitialized", (uint32_t)channel);

  return k_rx_ok;
}
